# .	匹配任意1个字符（除了\n）
# [ ]	匹配[ ]中列举的字符[ab456c][a-z]
# \d	匹配数字，即0-9
# \D	匹配非数字，即不是数字
# \s	匹配空白，即 空格，tab键\t,\n
# \S	匹配非空白
# \w	匹配单词字符，即a-z、A-Z、0-9、_,国家的文字
# \W	匹配非单词字符

import re

print('---------------------------------------------------------------1')
# 匹配任意一个数字
# 使用\d
# 判断用户是否输入的是速度与激情系列
p1 = re.compile('速度与激情\d')
print('--------下面你是findall查找到的--------')
data = p1.findall('速度与激情1速度与激情2')
print(data)

print('-------下面是search查找的----------')
data = p1.search('速度与激情1速度与激情2')
print(data)
print(data[0])

print('---------------------------------------------------------------2')
# 使用[]
# 格式1:[单个值,...]
# 判断用户只想看1,4,8的速度与激情

p1 = re.compile('速度与激情[138]')

print(p1.findall('速度与激情1速度与激情2速度与激情3速度与激情4'))



print('---------------------------------------------------------------3')
# 格式2:[范围,...]
# 判断用户只看1到8的速度与激情
p1 = re.compile('速度与激情[1-8]')

print(p1.findall('速度与激情1速度与激情2速度与激情3速度与激情4'))

print('---------------------------------------------------------------4')
# 格式3:[数字字符]
# 判断用户输入的速度与激情1到8或者速度与激情a-h
p1 = re.compile('速度与激情[0-9a-z]',re.I)

print(p1.findall('速度与激情1速度与激情0速度与激情A速度与激情z'))


print('---------------------------------------------------------------5')
# 使用\w 即a-z、A-Z、0-9、_这个范围太广,不要轻易用,汉字也可以匹配,其他的国家的语言也可以匹配
# 匹配的单词字符
# 判断用户输入包含速度与激情
# [a-zA-Z0-9_]
p1 = re.compile('速度与激情\w')

print(p1.findall('速度与激情1速度与激情0速度与激情A速度与激情z'))



print('---------------------------------------------------------------6')
# 使用\s
# --匹配空白字符
# --空格 或者 tab(\t),\n换行
# --判断用户速度与激情 8
p1 = re.compile('速度与激情\s*\w')
print(p1.findall('速度与激情 1\t速度与激情     0速度与激情A\n速度与激情z'))



print('---------------------------------------------------------------7')
# --大写是所有小写的非*******

# .匹配任意1个字符（除了\n）
# 	--匹配任意的字符
# 	--判断包含速度与激情字符串的
