a = [[1,[10]],12,2,3]
b= a
print(id(a),id(b),'\n',a,'  ',b)
print('*'*20)
a[0][0] = 22   #可以看到只要修改a,b也会跟着改变
print(id(a),id(b),'\n',a,'  ',b)

print('*'*20)
print('copy______')

'''
        copy
'''
a = [[1,[10]],12,2,3]
b = a.copy()  #使用copy后可以看到a和b指向了不同的内存
print(id(a),id(b),'\n',a,'  ',b)

a[1]= 13#现在修改一下a下标1的值
print(id(a[2]),id(b[2])) #没修改的地方还是指向了相同的内存(这里是为了节省资源)
print(id(a[1]),id(b[1]),a,'  ',b) #修改a的值后打印id发现内存 还有内容已经各不相同
print('*'*10)
a[0][1]='哈哈' #修改嵌套内部的值
print(a,b)
print(id(a[0]),id(b[0])) #值虽然已经修改  但是内存地址还是没变
